IdeaRS.OpenModel.Connection.CheckResWeld
Check value for Weld

IdeaRS.OpenModel.Connection.CheckResWeld.Name
Name of Weld

IdeaRS.OpenModel.Connection.CheckResWeld.Id
Unique id of weld

IdeaRS.OpenModel.Connection.CheckResWeld.UnityCheck
Unity Check Stress

IdeaRS.OpenModel.Connection.CheckResWeld.CheckStatus
Status of the Check

IdeaRS.OpenModel.Connection.CheckResWeld.LoadCaseId
Id of Load Case

IdeaRS.OpenModel.Connection.CheckResWeld.Items
In case of presentation of groups plates (uncoiled beams)